src/main/resources/samples/discovery-response.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"
	xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
	xmlns:d="http://schemas.xmlsoap.org/ws/2005/04/discovery"
	xmlns:dn="http://www.onvif.org/ver10/network/wsdl"
	xmlns:tds="http://www.onvif.org/ver10/device/wsdl">
	<s:Header>
		<wsa:MessageID>uuid:40e94f01-8fb8-c020-35e1-cda5145951c1
		</wsa:MessageID>
		<wsa:RelatesTo></wsa:RelatesTo>
		<wsa:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous
		</wsa:To>
		<wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches
		</wsa:Action>
	</s:Header>
	<s:Body>
		<d:ProbeMatches>
			<d:ProbeMatch>
				<wsa:EndpointReference>
					<wsa:Address>urn:uuid:e71a0684-4627-0972-73a1-5992f01993e4
					</wsa:Address>
				</wsa:EndpointReference>
				<d:Types>dn:NetworkVideoTransmitter tds:Device</d:Types>
				<d:Scopes>onvif://www.onvif.org/location/country/India
					onvif://www.onvif.org/name/CP_Plus_Cloud_Camera
					onvif://www.onvif.org/type/video_encoder
					onvif://www.onvif.org/Profile/Streaming
					onvif://www.onvif.org/Profile/T
				</d:Scopes>
				<d:XAddrs>http://192.168.0.113:8000/onvif/device_service</d:XAddrs>
				<d:MetadataVersion>1</d:MetadataVersion>
			</d:ProbeMatch>
		</d:ProbeMatches>
	</s:Body>
</s:Envelope>
